readme.org
#+TITLE: Nmap CheatSheeet
#+AUTHOR: MattiaCossu

* Introduction
Network Mapper (~Nmap~) is an open-source network analysis and security auditing tool written in C, C++, Python, and Lua. It is designed to scan networks and identify which hosts are available on the network using raw packets, and services and applications, including the name and version, where possible.
** Architecture
- Host discovery
- Port scanning
- Service enumeration and detection
- OS detection
- Scriptable interaction with the target service (Nmap Scripting Engine)
** Syntax
The syntax for Nmap is fairly simple and looks like this:
#+BEGIN_SRC bash
  nmap <scan types> <options> <target>
#+END_SRC
** Scan Techniques
Nmap offers many different scanning techniques, making different types of connections and using differently structured packets to send. Here we can see all the scanning techniques Nmap offers:
#+BEGIN_SRC bash
  nmap --help

  <SNIP>
  SCAN TECHNIQUES:
    -sS/sT/sA/sW/sM: TCP SYN/Connect()/ACK/Window/Maimon scans
    -sU: UDP Scan
    -sN/sF/sX: TCP Null, FIN, and Xmas scans
    --scanflags <flags>: Customize TCP scan flags
    -sI <zombie host[:probeport]>: Idle scan
    -sY/sZ: SCTP INIT/COOKIE-ECHO scans
    -sO: IP protocol scan
    -b <FTP relay host>: FTP bounce scan
    <SNIP>
#+END_SRC
* Host Discovery
** Scan Network Range
#+BEGIN_SRC bash
  sudo nmap 10.129.2.0/24 -sn -oA tnet | grep for | cut -d" " -f5
#+END_SRC
| *Scanning Options* | *Description*                                                      |
|------------------+------------------------------------------------------------------|
| ~10.129.2.0/24~    | Target network range.                                            |
| ~-sn~              | Disables port scanning.                                          |
| ~-oA tnet~         | Stores the results in all formats starting with the name 'tnet'. |
This scanning method works only if the firewalls of the hosts allow it.
** Scan IP List
List could look something like this:
#+BEGIN_SRC bash
  cat hosts.lst

  10.129.2.4
  10.129.2.10
  10.129.2.11
  10.129.2.18
  10.129.2.19
  10.129.2.20
  10.129.2.28
#+END_SRC

If we use the same scanning technique on the predefined list, the command will look like this:
#+BEGIN_SRC bash
  sudo nmap -sn -oA tnet -iL hosts.lst | grep for | cut -d" " -f5
#+END_SRC

| *Scanning Options* | *Description*                                                          |
|------------------+----------------------------------------------------------------------|
| ~-sn~              | Disables port scanning.                                              |
| ~-oA tnet~         | Stores the results in all formats starting with the name 'tnet'.     |
| ~-iL~              | Performs defined scans against targets in provided 'hosts.lst' list. |

In this example, we see that only 3 of 7 hosts are active. Remember, this may mean that the other hosts ignore the default ICMP echo requests because of their firewall configurations. Since Nmap does not receive a response, it marks those hosts as inactive.
** Scan Multiple IPs
It can also happen that we only need to scan a small part of a network. An alternative to the method we used last time is to specify multiple IP addresses.
#+BEGIN_SRC bash
  sudo nmap -sn -oA tnet 10.129.2.18 10.129.2.19 10.129.2.20| grep for | cut -d" " -f5
#+END_SRC

If these IP addresses are next to each other, we can also define the range in the respective octet.
#+BEGIN_SRC bash
  sudo nmap -sn -oA tnet 10.129.2.18-20| grep for | cut -d" " -f5
#+END_SRC
