readme.md


<a id="org0919d14"></a>

## Scan Single IP

Before we scan a single host for open ports and its services, we first have to determine if it is alive or not.

    sudo nmap 10.129.2.18 -sn -oA host 

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Scanning Options</b></th>
<th scope="col" class="org-left"><b>Description</b></th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left"><code>10.129.2.18</code></td>
<td class="org-left">Performs defined scans against the target.</td>
</tr>


<tr>
<td class="org-left"><code>-sn</code></td>
<td class="org-left">Disables port scanning.</td>
</tr>


<tr>
<td class="org-left"><code>-oA host</code></td>
<td class="org-left">Stores the results in all formats starting with the name 'host'.Stores the results in all formats starting with the name 'host'.</td>
</tr>

<tbody>
<tr>
</tr>
</tbody>
</table>

If we disable port scan (`-sn`), Nmap automatically ping scan with `ICMP Echo Requests` (`-PE`). Once such a request is sent, we usually expect an `ICMP reply` if the pinging host is alive. The more interesting fact is that our previous scans did not do that because before Nmap could send an ICMP echo request, it would send an `ARP ping` resulting in an `ARP reply`. We can confirm this with the "`--packet-trace`" option. To ensure that ICMP echo requests are sent, we also define the option (-PE) for this.

    sudo nmap 10.129.2.18 -sn -oA host -PE --packet-trace

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Scanning Options</b></th>
<th scope="col" class="org-left"><b>Description</b></th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left"><code>10.129.2.18</code></td>
<td class="org-left">Performs defined scans against the target.</td>
</tr>


<tr>
<td class="org-left"><code>-sn</code></td>
<td class="org-left">Disables port scanning.</td>
</tr>


<tr>
<td class="org-left"><code>-oA host</code></td>
<td class="org-left">Stores the results in all formats starting with the name 'host'.Stores the results in all formats starting with the name 'host'.</td>
</tr>


<tr>
<td class="org-left"><code>-PE</code></td>
<td class="org-left">Performs the ping scan by using 'ICMP Echo requests' against the target.</td>
</tr>


<tr>
<td class="org-left"><code>--packet-trace</code></td>
<td class="org-left">Shows all packets sent and received</td>
</tr>
</tbody>
</table>

Another way to determine why Nmap has our target marked as "`alive`" is with the "`--reason`" option.

    sudo nmap 10.129.2.18 -sn -oA host -PE --reason 

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Scanning Options</b></th>
<th scope="col" class="org-left"><b>Description</b></th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left"><code>10.129.2.18</code></td>
<td class="org-left">Performs defined scans against the target.</td>
</tr>


<tr>
<td class="org-left"><code>-sn</code></td>
<td class="org-left">Disables port scanning.</td>
</tr>


<tr>
<td class="org-left"><code>-oA host</code></td>
<td class="org-left">Stores the results in all formats starting with the name 'host'.Stores the results in all formats starting with the name 'host'.</td>
</tr>


<tr>
<td class="org-left"><code>-PE</code></td>
<td class="org-left">Performs the ping scan by using 'ICMP Echo requests' against the target.</td>
</tr>


<tr>
<td class="org-left"><code>--reason</code></td>
<td class="org-left">Displays the reason for specific result.</td>
</tr>
</tbody>
</table>

We see here that `Nmap` does indeed detect whether the host is alive or not through the `ARP request` and `ARP reply` alone. To disable ARP requests and scan our target with the desired `ICMP echo requests`, we can disable ARP pings by setting the "`--disable-arp-ping`" option. Then we can scan our target again and look at the packets sent and received.

More strategies about host discovery can be found at:

<https://nmap.org/book/host-discovery-strategies.html>


<a id="org34ca7d2"></a>

# Host an Port Scanning


<a id="org8b5841a"></a>

## Scanning Top 10 TCP Ports

    sudo nmap 10.129.2.28 --top-ports=10 

`-sS` SYN scan
`-p <port>` define port to scan
`--top-ports=10` scan top 10 ports
`-p-` all port
`-F` top 100 ports


<a id="orgf0ba561"></a>

## Nmap - Trace the Packets

    sudo nmap 10.129.2.28 -p 21 --packet-trace -Pn -n --disable-arp-ping

`--packet-trace`  Shows all packets sent and received.
`-n`  Disables DNS resolution.
`--disable-arp-ping`  Disables ARP ping.


<a id="org79bfdb0"></a>

## Connect Scan

The Nmap TCP Connect Scan (`-sT`) uses the TCP **three-way handshake** to determine if a specific port on a target host is open or closed. The scan sends an `SYN` packet to the target port and waits for a response. It is considered open if the target port responds with an `SYN-ACK` packet and closed if it responds with an `RST` packet.

    sudo nmap 10.129.2.28 -p 443 --packet-trace --disable-arp-ping -Pn -n --reason -sT


<a id="org97ef2d7"></a>

## Filtered Ports

Let us look at an example where the firewall `drops` the TCP packets we send for the port scan. Therefore we scan the TCP port 139, which was already shown as filtered. To be able to track how our sent packets are handled, we deactivate the ICMP echo requests (`-Pn`), DNS resolution (`-n`), and ARP ping scan (`--disable-arp-ping`) again.

    sudo nmap 10.129.2.28 -p 139 --packet-trace -n --disable-arp-ping -Pn
    
    Starting Nmap 7.80 ( https://nmap.org ) at 2020-06-15 15:45 CEST
    SENT (0.0381s) TCP 10.10.14.2:60277 > 10.129.2.28:139 S ttl=47 id=14523 iplen=44  seq=4175236769 win=1024 <mss 1460>
    SENT (1.0411s) TCP 10.10.14.2:60278 > 10.129.2.28:139 S ttl=45 id=7372 iplen=44  seq=4175171232 win=1024 <mss 1460>
    Nmap scan report for 10.129.2.28
    Host is up.
    
    PORT    STATE    SERVICE
    139/tcp filtered netbios-ssn
    MAC Address: DE:AD:00:00:BE:EF (Intel Corporate)
    
    Nmap done: 1 IP address (1 host up) scanned in 2.06 seconds

We see in the last scan that `Nmap` sent two TCP packets with the SYN flag. By the duration (`2.06s`) of the scan, we can recognize that it took much longer than the previous ones (~0.05s). The case is different if the firewall rejects the packets. For this, we look at TCP port <span class="underline">445</span>, which is handled accordingly by such a rule of the firewall.

    sudo nmap 10.129.2.28 -p 445 --packet-trace -n --disable-arp-ping -Pn
    
    Starting Nmap 7.80 ( https://nmap.org ) at 2020-06-15 15:55 CEST
    SENT (0.0388s) TCP 10.129.2.28:52472 > 10.129.2.28:445 S ttl=49 id=21763 iplen=44  seq=1418633433 win=1024 <mss 1460>
    RCVD (0.0487s) ICMP [10.129.2.28 > 10.129.2.28 Port 445 unreachable (type=3/code=3) ] IP [ttl=64 id=20998 iplen=72 ]
    Nmap scan report for 10.129.2.28
    Host is up (0.0099s latency).
    
    PORT    STATE    SERVICE
    445/tcp filtered microsoft-ds
    MAC Address: DE:AD:00:00:BE:EF (Intel Corporate)
    
    Nmap done: 1 IP address (1 host up) scanned in 0.05 seconds

As a response, we receive an `ICMP` reply with `type 3` and error `code 3`, which indicates that the desired host is unreachable. Nevertheless, if we know that the host is alive, we can strongly assume that the firewall on this port is rejecting the packets, and we will have to take a closer look at this port later.
