readme.org
** Style sheets
With the XML output, we can easily create HTML reports that are easy to read, even for non-technical people.
To convert the stored results from XML format to HTML, we can use the tool ~xsltproc~.
#+BEGIN_SRC bash
  xsltproc target.xml -o target.html
#+END_SRC

* Service Enumeration
** Service Version Detection
A full port scan takes quite a long time. To view the scan status, we can press the ~[Space Bar]~ during the scan, which will cause ~Nmap~ to show us the scan status.
#+BEGIN_SRC bash
  sudo nmap 10.129.2.28 -p- -sV
#+END_SRC

Another option (~--stats-every=5s~) that we can use is defining how periods of time the status should be shown. Here we can specify the number of seconds (~s~) or minutes (~m~), after which we want to get the status.
#+BEGIN_SRC bash
  sudo nmap 10.129.2.28 -p- -sV --stats-every=5s
#+END_SRC

~--stats-every=5s~ => Shows the progress of the scan every 5 seconds.

We can also increase the ~verbosity level~ (~-v~ / ~-vv~), which will show us the open ports directly when ~Nmap~ detects them.
#+BEGIN_SRC bash
  sudo nmap 10.129.2.28 -p- -sV -v 
#+END_SRC

~-v~ Increases the verbosity of the scan, which displays more detailed information.

** Banner Grabbing
Once the scan is complete, we will see all TCP ports with the corresponding service and their versions that are active on the system.
#+BEGIN_SRC bash
  sudo nmap 10.129.2.28 -p- -sV
#+END_SRC

Primarily, Nmap looks at the banners of the scanned ports and prints them out. If it cannot identify versions through the banners, Nmap attempts to identify them through a signature-based matching system, but this significantly increases the scan's duration. One disadvantage to Nmap's presented results is that the automatic scan can miss some information because sometimes Nmap does not know how to handle it. Let us look at an example of this.
#+BEGIN_SRC bash
  sudo nmap 10.129.2.28 -p- -sV -Pn -n --disable-arp-ping --packet-trace
#+END_SRC

~-p-~ => Scans all ports.
~-sV~ => Performs service version detection on specified ports.
~-Pn~ => Disables ICMP Echo requests.
~-n~ => Disables DNS resolution.
~--disable-arp-ping~ => Disables ARP ping.
~--packet-trace~ => Shows all packets sent and received.

However, it can happen that some services do not immediately provide such information. It is also possible to remove or manipulate the banners from the respective services. If we ~manually~ connect to the SMTP server using ~nc~, grab the banner, and intercept the network traffic using ~tcpdump~, we can see what ~Nmap~ did not show us.

_Tcpdump_
#+BEGIN_SRC bash
  sudo tcpdump -i eth0 host 10.10.14.2 and 10.129.2.28
#+END_SRC

_Nc_
#+BEGIN_SRC bash
  nc -nv 10.129.2.28 25
#+END_SRC

_Tcpdump - Intercepted Traffic_
#+BEGIN_SRC bash
  18:28:07.128564 IP 10.10.14.2.59618 > 10.129.2.28.smtp: Flags [S], seq 1798872233, win 65535, options [mss 1460,nop,wscale 6,nop,nop,TS val 331260178 ecr 0,sackOK,eol], length 0
  18:28:07.255151 IP 10.129.2.28.smtp > 10.10.14.2.59618: Flags [S.], seq 1130574379, ack 1798872234, win 65160, options [mss 1460,sackOK,TS val 1800383922 ecr 331260178,nop,wscale 7], length 0
  18:28:07.255281 IP 10.10.14.2.59618 > 10.129.2.28.smtp: Flags [.], ack 1, win 2058, options [nop,nop,TS val 331260304 ecr 1800383922], length 0
  18:28:07.319306 IP 10.129.2.28.smtp > 10.10.14.2.59618: Flags [P.], seq 1:36, ack 1, win 510, options [nop,nop,TS val 1800383985 ecr 331260304], length 35: SMTP: 220 inlane ESMTP Postfix (Ubuntu)
#+END_SRC
* Nmap Scripting Engine
Nmap Scripting Engine (~NSE~) is another handy feature of ~Nmap~. It provides us with the possibility to create scripts in Lua for interaction with certain services. There are a total of 14 categories into which these scripts can be divided:

| *Category*  | *Description*                                                                                                                             |
|-----------+-----------------------------------------------------------------------------------------------------------------------------------------|
| ~auth~      | Determination of authentication credentials.                                                                                            |
| ~brodcast~  | Scripts, which are used for host discovery by broadcasting and the discovered hosts, can be automatically added to the remaining scans. |
| ~brute~     | Executes scripts that try to log in to the respective service by brute-forcing with credentials.                                        |
| ~default~   | Default scripts executed by using the ~-sC~ option.                                                                                       |
| ~discovery~ | Evaluation of accessible services.                                                                                                      |
| ~dos~       | These scripts are used to check services for denial of service vulnerabilities and are used less as it harms the services.              |
| ~exploit~   | This category of scripts tries to exploit known vulnerabilities for the scanned port.                                                   |
| ~external~  | Scripts that use external services for further processing.                                                                              |
| ~fuzzer~    | This uses scripts to identify vulnerabilities and unexpected packet handling by sending different fields, which can take much time.     |
| ~intrusive~ | Intrusive scripts that could negatively affect the target system.                                                                       |
| ~malware~   | Checks if some malware infects the target system.                                                                                       |
| ~safe~      | Defensive scripts that do not perform intrusive and destructive access.                                                                 |
| ~version~   | Extension for service detection.                                                                                                        |
| ~vuln~      | Identification of specific vulnerabilities.                                                                                             |
** Default Scripts
#+BEGIN_SRC bash
  sudo nmap <target> -sC
#+END_SRC
** Specific Scripts Category
#+BEGIN_SRC bash
  sudo nmap <target> --script <category>
#+END_SRC
** Defined Scripts
#+BEGIN_SRC bash
  sudo nmap <target> --script <script-name>,<script-name>,...
#+END_SRC
** Nmap - Specifying Scripts
#+BEGIN_SRC bash
  sudo nmap 10.129.2.28 -p 25 --script banner,smtp-commands
#+END_SRC

~--script banner,smtp-commands~ => Uses specified NSE scripts.
** Nmap - Scansione aggressiva
#+BEGIN_SRC bash
  sudo nmap 10.129.2.28 -p 80 -A
#+END_SRC
** Vulnerability Assessment
Now let us move on to HTTP port 80 and see what information and vulnerabilities we can find using the ~vuln~ category from ~NSE~.
*** Nmap - Vuln Category
#+BEGIN_SRC bash
  sudo nmap 10.129.2.28 -p 80 -sV --script vuln
#+END_SRC
* Performance
Scanning performance plays a significant role when we need to scan an extensive network or are dealing with low network bandwidth. We can use various options to tell ~Nmap~ how fast (~-T <0-5>~), with which frequency (~--min-parallelism <number>~), which timeouts (~--max-rtt-timeout <time>~) the test packets should have, how many packets should be sent simultaneously (~--min-rate <number>~), and with the number of retries (~--max-retries <number>~) for the scanned ports the targets should be scanned.
** Timeouts
When Nmap sends a packet, it takes some time (~Round-Trip-Time - RTT~) to receive a response from the scanned port. Generally, ~Nmap~ starts with a high timeout (~--min-RTT-timeout~) of 100ms. 
*** Default Scan
#+BEGIN_SRC bash
  sudo nmap 10.129.2.0/24 -F
#+END_SRC
