readme.md


<a id="org9414865"></a>

## Style sheets

With the XML output, we can easily create HTML reports that are easy to read, even for non-technical people.
To convert the stored results from XML format to HTML, we can use the tool `xsltproc`.

    xsltproc target.xml -o target.html


<a id="org314c0cb"></a>

# Service Enumeration


<a id="orgee735ce"></a>

## Service Version Detection

A full port scan takes quite a long time. To view the scan status, we can press the `[Space Bar]` during the scan, which will cause `Nmap` to show us the scan status.

    sudo nmap 10.129.2.28 -p- -sV

Another option (`--stats-every=5s`) that we can use is defining how periods of time the status should be shown. Here we can specify the number of seconds (`s`) or minutes (`m`), after which we want to get the status.

    sudo nmap 10.129.2.28 -p- -sV --stats-every=5s

`--stats-every=5s` => Shows the progress of the scan every 5 seconds.

We can also increase the `verbosity level` (`-v` / `-vv`), which will show us the open ports directly when `Nmap` detects them.

    sudo nmap 10.129.2.28 -p- -sV -v 

`-v` Increases the verbosity of the scan, which displays more detailed information.


<a id="org0ffc276"></a>

## Banner Grabbing

Once the scan is complete, we will see all TCP ports with the corresponding service and their versions that are active on the system.

    sudo nmap 10.129.2.28 -p- -sV

Primarily, Nmap looks at the banners of the scanned ports and prints them out. If it cannot identify versions through the banners, Nmap attempts to identify them through a signature-based matching system, but this significantly increases the scan's duration. One disadvantage to Nmap's presented results is that the automatic scan can miss some information because sometimes Nmap does not know how to handle it. Let us look at an example of this.

    sudo nmap 10.129.2.28 -p- -sV -Pn -n --disable-arp-ping --packet-trace

`-p-` => Scans all ports.
`-sV` => Performs service version detection on specified ports.
`-Pn` => Disables ICMP Echo requests.
`-n` => Disables DNS resolution.
`--disable-arp-ping` => Disables ARP ping.
`--packet-trace` => Shows all packets sent and received.

However, it can happen that some services do not immediately provide such information. It is also possible to remove or manipulate the banners from the respective services. If we `manually` connect to the SMTP server using `nc`, grab the banner, and intercept the network traffic using `tcpdump`, we can see what `Nmap` did not show us.

<span class="underline">Tcpdump</span>

    sudo tcpdump -i eth0 host 10.10.14.2 and 10.129.2.28

<span class="underline">Nc</span>

    nc -nv 10.129.2.28 25

<span class="underline">Tcpdump - Intercepted Traffic</span>

    18:28:07.128564 IP 10.10.14.2.59618 > 10.129.2.28.smtp: Flags [S], seq 1798872233, win 65535, options [mss 1460,nop,wscale 6,nop,nop,TS val 331260178 ecr 0,sackOK,eol], length 0
    18:28:07.255151 IP 10.129.2.28.smtp > 10.10.14.2.59618: Flags [S.], seq 1130574379, ack 1798872234, win 65160, options [mss 1460,sackOK,TS val 1800383922 ecr 331260178,nop,wscale 7], length 0
    18:28:07.255281 IP 10.10.14.2.59618 > 10.129.2.28.smtp: Flags [.], ack 1, win 2058, options [nop,nop,TS val 331260304 ecr 1800383922], length 0
    18:28:07.319306 IP 10.129.2.28.smtp > 10.10.14.2.59618: Flags [P.], seq 1:36, ack 1, win 510, options [nop,nop,TS val 1800383985 ecr 331260304], length 35: SMTP: 220 inlane ESMTP Postfix (Ubuntu)


<a id="org0e658e2"></a>

# Nmap Scripting Engine

Nmap Scripting Engine (`NSE`) is another handy feature of `Nmap`. It provides us with the possibility to create scripts in Lua for interaction with certain services. There are a total of 14 categories into which these scripts can be divided:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Category</b></th>
<th scope="col" class="org-left"><b>Description</b></th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left"><code>auth</code></td>
<td class="org-left">Determination of authentication credentials.</td>
</tr>


<tr>
<td class="org-left"><code>brodcast</code></td>
<td class="org-left">Scripts, which are used for host discovery by broadcasting and the discovered hosts, can be automatically added to the remaining scans.</td>
</tr>


<tr>
<td class="org-left"><code>brute</code></td>
<td class="org-left">Executes scripts that try to log in to the respective service by brute-forcing with credentials.</td>
</tr>


<tr>
<td class="org-left"><code>default</code></td>
<td class="org-left">Default scripts executed by using the <code>-sC</code> option.</td>
</tr>


<tr>
<td class="org-left"><code>discovery</code></td>
<td class="org-left">Evaluation of accessible services.</td>
</tr>


<tr>
<td class="org-left"><code>dos</code></td>
<td class="org-left">These scripts are used to check services for denial of service vulnerabilities and are used less as it harms the services.</td>
</tr>


<tr>
<td class="org-left"><code>exploit</code></td>
<td class="org-left">This category of scripts tries to exploit known vulnerabilities for the scanned port.</td>
</tr>


<tr>
<td class="org-left"><code>external</code></td>
<td class="org-left">Scripts that use external services for further processing.</td>
</tr>


<tr>
<td class="org-left"><code>fuzzer</code></td>
<td class="org-left">This uses scripts to identify vulnerabilities and unexpected packet handling by sending different fields, which can take much time.</td>
</tr>


<tr>
<td class="org-left"><code>intrusive</code></td>
<td class="org-left">Intrusive scripts that could negatively affect the target system.</td>
</tr>


<tr>
<td class="org-left"><code>malware</code></td>
<td class="org-left">Checks if some malware infects the target system.</td>
</tr>


<tr>
<td class="org-left"><code>safe</code></td>
<td class="org-left">Defensive scripts that do not perform intrusive and destructive access.</td>
</tr>


<tr>
<td class="org-left"><code>version</code></td>
<td class="org-left">Extension for service detection.</td>
</tr>


<tr>
<td class="org-left"><code>vuln</code></td>
<td class="org-left">Identification of specific vulnerabilities.</td>
</tr>
</tbody>
</table>


<a id="org3d4f183"></a>

## Default Scripts

    sudo nmap <target> -sC


<a id="org70558b2"></a>

## Specific Scripts Category

    sudo nmap <target> --script <category>


<a id="org8d360bd"></a>

## Defined Scripts

    sudo nmap <target> --script <script-name>,<script-name>,...


<a id="orgd6093f4"></a>

## Nmap - Specifying Scripts

    sudo nmap 10.129.2.28 -p 25 --script banner,smtp-commands

`--script banner,smtp-commands` => Uses specified NSE scripts.


<a id="org3a310c6"></a>

## Nmap - Scansione aggressiva

    sudo nmap 10.129.2.28 -p 80 -A


<a id="org61a0ac3"></a>

## Vulnerability Assessment

Now let us move on to HTTP port 80 and see what information and vulnerabilities we can find using the `vuln` category from `NSE`.


<a id="org3d21e50"></a>

### Nmap - Vuln Category

    sudo nmap 10.129.2.28 -p 80 -sV --script vuln


<a id="orgf66538e"></a>

# Performance

Scanning performance plays a significant role when we need to scan an extensive network or are dealing with low network bandwidth. We can use various options to tell `Nmap` how fast (`-T <0-5>`), with which frequency (`--min-parallelism <number>`), which timeouts (`--max-rtt-timeout <time>`) the test packets should have, how many packets should be sent simultaneously (`--min-rate <number>`), and with the number of retries (`--max-retries <number>`) for the scanned ports the targets should be scanned.


<a id="orgb284c89"></a>

## Timeouts

When Nmap sends a packet, it takes some time (`Round-Trip-Time - RTT`) to receive a response from the scanned port. Generally, `Nmap` starts with a high timeout (`--min-RTT-timeout`) of 100ms. 
