readme.org
*** Optimized RTT
#+BEGIN_SRC bash
  sudo nmap 10.129.2.0/24 -F --initial-rtt-timeout 50ms --max-rtt-timeout 100ms
#+END_SRC
~-F~ => Scans top 100 ports.
~--initial-rtt-timeout 50ms~ => Sets the specified time value as initial RTT timeout.
~--max-rtt-timeout 100ms~ => Sets the specified time value as maximum RTT timeout.
** Max Retries
Another way to increase the scans' speed is to specify the retry rate of the sent packets (~--max-retries~). The default value for the retry rate is ~10~, so if ~Nmap~ does not receive a response for a port, it will not send any more packets to the port and will be skipped.
*** Default Scan
#+BEGIN_SRC bash
  sudo nmap 10.129.2.0/24 -F | grep "/tcp" | wc -l
#+END_SRC
*** Reduced Retries
#+BEGIN_SRC bash
  sudo nmap 10.129.2.0/24 -F --max-retries 0 | grep "/tcp" | wc -l
#+END_SRC

~--max-retries 0~ => Sets the number of retries that will be performed during the scan.
** Rates
During a white-box penetration test, we may get whitelisted for the security systems to check the systems in the network for vulnerabilities and not only test the protection measures. If we know the network bandwidth, we can work with the rate of packets sent, which significantly speeds up our scans with ~Nmap~. When setting the minimum rate (~--min-rate <number>~) for sending packets, we tell ~Nmap~ to simultaneously send the specified number of packets. It will attempt to maintain the rate accordingly.
*** Default Scan
#+BEGIN_SRC bash
  sudo nmap 10.129.2.0/24 -F -oN tnet.default
#+END_SRC
*** Optimized Scan
#+BEGIN_SRC bash
  sudo nmap 10.129.2.0/24 -F -oN tnet.minrate300 --min-rate 300
#+END_SRC

~-oN tnet.minrate 300~ => Saves the results in normal formats, starting the specified file name.
~--min-rate 300~ => Sets the minimum number of packets to be sent per second.
*** Default Scan - Found Open Ports
#+BEGIN_SRC bash
  cat tnet.default | grep "/tcp" | wc -l
#+END_SRC
*** Optimized Scan - Found Open Ports
#+BEGIN_SRC bash
  cat tnet.minrate300 | grep "/tcp" | wc -l
#+END_SRC
** Timing
Because such settings cannot always be optimized manually, as in a black-box penetration test, ~Nmap~ offers six different timing templates (~-T <0-5>~) for us to use. These values (~0-5~) determine the aggressiveness of our scans.
- ~-T 0~ / ~-T paranoid~
- ~-T 1~ / ~-T sneaky~
- ~-T 2~ / ~-T polite~
- ~-T 3~ / ~-T normal~
- ~-T 4~ / ~-T aggressive~
- ~-T 5~ / ~-T insane~
*** Default Scan
#+BEGIN_SRC bash
  sudo nmap 10.129.2.0/24 -F -oN tnet.default 
#+END_SRC
*** Insane Scan
#+BEGIN_SRC bash
  sudo nmap 10.129.2.0/24 -F -oN tnet.T5 -T 5
#+END_SRC

~-oN tnet.T5~ => Saves the results in normal formats, starting the specified file name.
~-T 5~ => Specifies the insane timing template.
*** Default Scan - Found Open Ports
#+BEGIN_SRC bash
  cat tnet.default | grep "/tcp" | wc -l
#+END_SRC
*** Insane Scan - Found Open Ports
#+BEGIN_SRC bash
  cat tnet.T5 | grep "/tcp" | wc -l
#+END_SRC
* Firewall and IDS/IPS Evasion
~Nmap~ has tricks to sneak past ~firewalls~ and ~IDS~ / ~IPS~. For example, it can send packets in tiny pieces or pretend to be someone else.
** Determine Firewalls and Their Rules
We already know that when a port is shown as filtered, it can have several reasons. In most cases, firewalls have certain rules set to handle specific connections. The packets can either be ~dropped~, or ~rejected~. The ~dropped~ packets are ignored, and no response is returned from the host.

This is different for ~rejected~ packets that are returned with an ~RST~ flag. These packets contain different types of ICMP error codes or contain nothing at all.
_SYN-Scan_
#+BEGIN_SRC bash
  sudo nmap 10.129.2.28 -p 21,22,25 -sS -Pn -n --disable-arp-ping --packet-trace
#+END_SRC
_ACK-Scan_
#+BEGIN_SRC bash
  sudo nmap 10.129.2.28 -p 21,22,25 -sA -Pn -n --disable-arp-ping --packet-trace
#+END_SRC

~-sS~	Performs SYN scan on specified ports.
~-sA~	Performs ACK scan on specified ports.
~-Pn~	Disables ICMP Echo requests.
~-n~	Disables DNS resolution.
~--disable-arp-ping~	Disables ARP ping.
~--packet-trace~	Shows all packets sent and received.
*** Testing Firewall Rule
#+BEGIN_SRC bash
  sudo nmap 10.129.2.28 -n -Pn -p445 -O
#+END_SRC
_Scan by Using Different Source IP_
#+BEGIN_SRC bash
  sudo nmap 10.129.2.28 -n -Pn -p 445 -O -S 10.129.2.200 -e tun0
#+END_SRC
** Detect IDS/IPS
Unlike firewalls and their rules, the detection of IDS/IPS systems is much more difficult because these are passive traffic monitoring systems
*** IDS
~IDS systems~ examine all connections between hosts. If the IDS finds packets containing the defined contents or specifications, the administrator is notified and takes appropriate action in the worst case.

IDS systems alone are usually there to help administrators detect potential attacks on their network. They can then decide how to handle such connections. We can trigger certain security measures from an administrator, for example, by aggressively scanning a single port and its service. Based on whether specific security measures are taken, we can detect if the network has some monitoring applications or not.
*** IPS
One method to determine whether such ~IPS system~ is present in the target network is to scan from a single host (~VPS~). If at any time this host is blocked and has no access to the target network, we know that the administrator has taken some security measures. Accordingly, we can continue our penetration test with another ~VPS~.
*** Decoys
Decoy scanning method (-D) is the right choice.
With this method, Nmap generates various random IP addresses inserted into the IP header to disguise the origin of the packet sent.

~RND~ value for specific number of IP address separated by a colon (~:~).
_Scan by Using Decoys_
#+BEGIN_SRC bash
  sudo nmap 10.129.2.28 -p 80 -sS -Pn -n --disable-arp-ping --packet-trace -D RND:5
#+END_SRC

~-sS~	Performs SYN scan on specified ports.
~-Pn~	Disables ICMP Echo requests.
~-n~	Disables DNS resolution.
~--disable-arp-ping~	Disables ARP ping.
~--packet-trace~	Shows all packets sent and received.
~-D RND:5~	Generates five random IP addresses that indicates the source IP the connection comes from.

The spoofed packets are often filtered out by ISPs and routers, even though they come from the same network range. Therefore, we can also specify our VPS servers' IP addresses and use them in combination with "IP ID" manipulation in the IP headers to scan the target.

Another scenario would be that only individual subnets would not have access to the server's specific services. So we can also manually specify the source IP address (~-S~) to test if we get better results with this one. Decoys can be used for SYN, ACK, ICMP scans, and OS detection scans.
#+BEGIN_SRC bash
  sudo nmap 10.129.2.28 -n -Pn -p 445 -O -S 10.129.2.200 -e tun0
#+END_SRC
