readme.org
** DNS Proxying
By default, ~Nmap~ performs a reverse DNS resolution unless otherwise specified to find more important information about our target. These DNS queries are also passed in most cases because the given web server is supposed to be found and visited. The DNS queries are made over the ~UDP port 53~. The ~TCP port 53~ was previously only used for the so-called "~Zone transfers~" between the DNS servers or data transfer larger than 512 bytes. More and more, this is changing due to IPv6 and DNSSEC expansions. These changes cause many DNS requests to be made via TCP port 53.

However, ~Nmap~ still gives us a way to specify DNS servers ourselves (~--dns-server <ns>,<ns>~). This method could be fundamental to us if we are in a demilitarized zone (~DMZ~). The company's DNS servers are usually more trusted than those from the Internet. So, for example, we could use them to interact with the hosts of the internal network. As another example, we can use ~TCP port 53~ as a source port (~--source-port~) for our scans. If the administrator uses the firewall to control this port and does not filter IDS/IPS properly, our TCP packets will be trusted and passed through.

_SYN-Scan of a Filtered Port_
#+BEGIN_SRC bash
  sudo nmap 10.129.2.28 -p50000 -sS -Pn -n --disable-arp-ping --packet-trace
#+END_SRC

_SYN-Scan From DNS Port_
#+BEGIN_SRC bash
sudo nmap 10.129.2.28 -p50000 -sS -Pn -n --disable-arp-ping --packet-trace --source-port 53
#+END_SRC

Now that we have found out that the firewall accepts ~TCP port 53~, it is very likely that IDS/IPS filters might also be configured much weaker than others. We can test this by trying to connect to this port by using ~Netcat~.

_Connect To The Filtered Port_
#+BEGIN_SRC bash
  ncat -nv --source-port 53 10.129.2.28 50000
#+END_SRC
